app/controllers/lftmes_controller.rb

  def index
    @lftmes = Lftme.all
---
SELECT "lftmes".* FROM "lftmes"

  def create
    @lftme = Lftme.new(lftme_params)

    respond_to do |format|
      if @lftme.save
---
INSERT INTO "lftmes" ("created_at", "location", "request", "updated_at", "user") VALUES (?, ?, ?, ?, ?)

    def set_lftme
      @lftme = Lftme.find(params[:id])
---
SELECT "lftmes".* FROM "lftmes" WHERE "lftmes"."id" = ? LIMIT 1  [["id", "1"]]